## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 6 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.internal_domain must be replaced
+/- resource "aws_acm_certificate" "internal_domain" {
      ~ arn                       = "arn:aws:acm:ca-central-1:794722365809:certificate/a4c2e5f7-1ee2-47ad-ba71-41f9646bf4df" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.dependencies.security.cdssandbox.xyz"
              - resource_record_name  = "_c5f687243982a3353f0c1d2b916dc6ae.dependencies.security.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_8a0a9e9338470e6ea1a56e5d3988a27f.rdnyqppgxp.acm-validations.aws."
            },
          - {
              - domain_name           = "*.security.cdssandbox.xyz"
              - resource_record_name  = "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_550d8030017ca9b728d7a636448967c6.rdvkfhcmrm.acm-validations.aws."
            },
          - {
              - domain_name           = "security.cdssandbox.xyz"
              - resource_record_name  = "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_550d8030017ca9b728d7a636448967c6.rdvkfhcmrm.acm-validations.aws."
            },
            # (2 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:794722365809:certificate/a4c2e5f7-1ee2-47ad-ba71-41f9646bf4df" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2023-06-11T23:59:59Z" -> (known after apply)
      ~ not_before                = "2022-05-13T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.dependencies.security.cdssandbox.xyz",
            # (2 unchanged elements hidden)
        ]
        tags                      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (3 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.internal_domain_certificate_validation must be replaced
-/+ resource "aws_acm_certificate_validation" "internal_domain_certificate_validation" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:794722365809:certificate/a4c2e5f7-1ee2-47ad-ba71-41f9646bf4df" -> (known after apply) # forces replacement
      ~ id                      = "2022-05-13 21:59:51.104 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz",
          - "_c5f687243982a3353f0c1d2b916dc6ae.dependencies.security.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_lb_listener.https will be updated in-place
  ~ resource "aws_lb_listener" "https" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:794722365809:certificate/a4c2e5f7-1ee2-47ad-ba71-41f9646bf4df" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:listener/app/pomerium-sso/8336710adf9ed205/4a6952cab8ff3686"
        tags              = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_listener_certificate.https_sni must be replaced
-/+ resource "aws_lb_listener_certificate" "https_sni" {
      ~ certificate_arn = "arn:aws:acm:ca-central-1:794722365809:certificate/a4c2e5f7-1ee2-47ad-ba71-41f9646bf4df" -> (known after apply) # forces replacement
      ~ id              = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:listener/app/pomerium-sso/8336710adf9ed205/4a6952cab8ff3686_arn:aws:acm:ca-central-1:794722365809:certificate/a4c2e5f7-1ee2-47ad-ba71-41f9646bf4df" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.internal_domain_dns_validation["*.dependencies.security.cdssandbox.xyz"] will be destroyed
  # (because key ["*.dependencies.security.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "internal_domain_dns_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_c5f687243982a3353f0c1d2b916dc6ae.dependencies.security.cdssandbox.xyz" -> null
      - id              = "Z0613484AYPNOGR8FJVN__c5f687243982a3353f0c1d2b916dc6ae.dependencies.security.cdssandbox.xyz._CNAME" -> null
      - name            = "_c5f687243982a3353f0c1d2b916dc6ae.dependencies.security.cdssandbox.xyz" -> null
      - records         = [
          - "_8a0a9e9338470e6ea1a56e5d3988a27f.rdnyqppgxp.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z0613484AYPNOGR8FJVN" -> null
    }

  # aws_route53_record.internal_domain_dns_validation["*.security.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "internal_domain_dns_validation" {
      ~ fqdn            = "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz" -> (known after apply)
      ~ id              = "Z0613484AYPNOGR8FJVN__c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz._CNAME" -> (known after apply)
      ~ name            = "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz" -> (known after apply) # forces replacement
      ~ records         = [
          - "_550d8030017ca9b728d7a636448967c6.rdvkfhcmrm.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.internal_domain_dns_validation["security.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "internal_domain_dns_validation" {
      ~ fqdn            = "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz" -> (known after apply)
      ~ id              = "Z0613484AYPNOGR8FJVN__c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz._CNAME" -> (known after apply)
      ~ name            = "_c1323b3f2ac47cac22c9932da461a8de.security.cdssandbox.xyz" -> (known after apply) # forces replacement
      ~ records         = [
          - "_550d8030017ca9b728d7a636448967c6.rdvkfhcmrm.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
